app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Back End Engineering"], ["room_number", 606], ["created_at", "2019-05-23 00:14:49.713181"], ["updated_at", "2019-05-23 00:14:49.713181"]]
---
  def create
    @school_class = SchoolClass.create(class_params)

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-05-23 00:24:38.264930"], ["id", 1]]
---
  def update
    @school_class.update(class_params)